content/posts/common-symbols.org
#+TITLE: 常用标点符号
#+DATE: <2021-05-01 Sat>
#+TAGS[]: 备忘

* 中文标点符号

| 符号             | 名称                                                                                             |
|------------------+--------------------------------------------------------------------------------------------------|
| 。               | 句号                                                                                             |
| ，               | 逗号                                                                                             |
| 、               | 顿号                                                                                             |
| ；               | 分号                                                                                             |
| ：               | 冒号                                                                                             |
| 「」『』“”''     | 直角引号、弯引号                                                                                 |
| （）［］〔〕【】 | 圆括号、方括号、六角括号、方头括号                                                               |
| ------           | 破折号                                                                                           |
| ......           | 省略号                                                                                           |
| －-～            | 连接号（一字线：占一个字的位置；短横线：占半个字的位置；浪纹线：占一个字的位置。它们都上下居中） |
| ·．              | 间隔号                                                                                           |
| 《》〈〉﹏﹏     | 书名号（双书名号、单书名号、浪线书名号）                                                         |
| ＿＿             | 专名号                                                                                           |
| .                | 着重号                                                                                           |

* 英文标点符号

| 符号            | 名称                                                               |
|-----------------+--------------------------------------------------------------------|
| .               | full stop(BrE), period(AmE)                                        |
| ?               | question mark                                                      |
| !               | exclamation mark                                                   |
| ,               | comma                                                              |
| :               | colon                                                              |
| ...             | ellipsis(复数：ellipses)                                           |
| ;               | semicolon                                                          |
| -               | hyphen(连字符)                                                     |
| --    =&ndash;= | en dash(连接号)                                                    |
| ---  =&mdash;=  | em dash(破折号)                                                    |
| ()<<>>          | parentheses,round brackets; square brackets; braces,curly brackets |
| “'              | double quotation marks; single quotation marks                     |
| '               | apostrophe                                                         |
| `               | backtick                                                           |

* 希腊字母

** 小写

α ▪ β ▪ γ ▪ δ ▪ ϵ ▪ ζ ▪ η ▪ θ ▪ ι ▪ κ ▪ λ ▪ μ ▪ ν ▪ ξ ▪ ο ▪ π ▪ ρ ▪ σ ▪
τ ▪ υ ▪ ϕ ▪ χ ▪ ψ ▪ ω

** 大写

Α ▪ Β ▪ Γ ▪ Δ ▪ Ε ▪ Ζ ▪ Η ▪ Θ ▪ Ι ▪ Κ ▪ Λ ▪ Μ ▪ Ν ▪ Ξ ▪ Ο ▪ Π ▪ Ρ ▪ Σ ▪
Τ ▪ Υ ▪ Φ ▪ Χ ▪ Ψ ▪ Ω

--------------

参考资料

-  [[https://zh-style-guide.readthedocs.io/zh_CN/latest/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7/%E5%B8%B8%E7%94%A8%E4%B8%AD%E6%96%87%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7.html][常用中文标点符号-中文技术文档写作风格指南]]
-  [[https://zh.wikipedia.org/wiki/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7#%E5%B8%B8%E7%94%A8%E7%9A%84%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7][常用的标点符号-维基中文]]
-  [[https://reference.wolframcloud.com/language/guide/GreekLetters.html.zh][希腊字母-Wolfram 语言与系统参考资料中心]]
-  [[https://baike.baidu.com/item/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7][标点符号 - 百度百科]]
