blog/2021/common-symbols.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 11:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>常用标点符号</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">常用标点符号</h1>
</header>
<div id="outline-container-中文标点符号" class="outline-2">
<h2 id="中文标点符号">中文标点符号</h2>
<div class="outline-text-2" id="text-中文标点符号">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">符号</th>
<th scope="col" class="org-left">名称</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">。</td>
<td class="org-left">句号</td>
</tr>

<tr>
<td class="org-left">，</td>
<td class="org-left">逗号</td>
</tr>

<tr>
<td class="org-left">、</td>
<td class="org-left">顿号</td>
</tr>

<tr>
<td class="org-left">；</td>
<td class="org-left">分号</td>
</tr>

<tr>
<td class="org-left">：</td>
<td class="org-left">冒号</td>
</tr>

<tr>
<td class="org-left">「」『』“”''</td>
<td class="org-left">直角引号、弯引号</td>
</tr>

<tr>
<td class="org-left">（）［］〔〕【】</td>
<td class="org-left">圆括号、方括号、六角括号、方头括号</td>
</tr>

<tr>
<td class="org-left">------</td>
<td class="org-left">破折号</td>
</tr>

<tr>
<td class="org-left">&#x2026;&#x2026;</td>
<td class="org-left">省略号</td>
</tr>

<tr>
<td class="org-left">－-～</td>
<td class="org-left">连接号（一字线：占一个字的位置；短横线：占半个字的位置；浪纹线：占一个字的位置。它们都上下居中）</td>
</tr>

<tr>
<td class="org-left">·．</td>
<td class="org-left">间隔号</td>
</tr>

<tr>
<td class="org-left">《》〈〉﹏﹏</td>
<td class="org-left">书名号（双书名号、单书名号、浪线书名号）</td>
</tr>

<tr>
<td class="org-left">＿＿</td>
<td class="org-left">专名号</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">着重号</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-英文标点符号" class="outline-2">
<h2 id="英文标点符号">英文标点符号</h2>
<div class="outline-text-2" id="text-英文标点符号">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">符号</th>
<th scope="col" class="org-left">名称</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">.</td>
<td class="org-left">full stop(BrE), period(AmE)</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">question mark</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">exclamation mark</td>
</tr>

<tr>
<td class="org-left">,</td>
<td class="org-left">comma</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">colon</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">ellipsis(复数：ellipses)</td>
</tr>

<tr>
<td class="org-left">;</td>
<td class="org-left">semicolon</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">hyphen(连字符)</td>
</tr>

<tr>
<td class="org-left">--</td>
<td class="org-left">en dash(连接号)</td>
</tr>

<tr>
<td class="org-left">---</td>
<td class="org-left">em dash(破折号)</td>
</tr>

<tr>
<td class="org-left">()&lt;&lt;&gt;&gt;</td>
<td class="org-left">parentheses,round brackets; square brackets; braces,curly brackets</td>
</tr>

<tr>
<td class="org-left">“'</td>
<td class="org-left">double quotation marks; single quotation marks</td>
</tr>

<tr>
<td class="org-left">'</td>
<td class="org-left">apostrophe</td>
</tr>

<tr>
<td class="org-left">`</td>
<td class="org-left">backtick</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-希腊字母" class="outline-2">
<h2 id="希腊字母">希腊字母</h2>
<div class="outline-text-2" id="text-希腊字母">
</div>
<div id="outline-container-小写" class="outline-3">
<h3 id="小写">小写</h3>
<div class="outline-text-3" id="text-小写">
<p>
α ▪ β ▪ γ ▪ δ ▪ ϵ ▪ ζ ▪ η ▪ θ ▪ ι ▪ κ ▪ λ ▪ μ ▪ ν ▪ ξ ▪ ο ▪ π ▪ ρ ▪ σ ▪
τ ▪ υ ▪ ϕ ▪ χ ▪ ψ ▪ ω
</p>
</div>
</div>

<div id="outline-container-大写" class="outline-3">
<h3 id="大写">大写</h3>
<div class="outline-text-3" id="text-大写">
<p>
Α ▪ Β ▪ Γ ▪ Δ ▪ Ε ▪ Ζ ▪ Η ▪ Θ ▪ Ι ▪ Κ ▪ Λ ▪ Μ ▪ Ν ▪ Ξ ▪ Ο ▪ Π ▪ Ρ ▪ Σ ▪
Τ ▪ Υ ▪ Φ ▪ Χ ▪ Ψ ▪ Ω
</p>

<hr>

<p>
*参考资料*：
</p>

<ol class="org-ol">
<li><a href="https://zh-style-guide.readthedocs.io/zh_CN/latest/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7/%E5%B8%B8%E7%94%A8%E4%B8%AD%E6%96%87%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7.html">常用中文标点符号-中文技术文档写作风格指南</a></li>
<li><a href="https://zh.wikipedia.org/wiki/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7#%E5%B8%B8%E7%94%A8%E7%9A%84%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7">常用的标点符号-维基中文</a></li>
<li><a href="https://reference.wolframcloud.com/language/guide/GreekLetters.html.zh">希腊字母-Wolfram
语言与系统参考资料中心</a></li>
<li><a href="https://baike.baidu.com/item/%E6%A0%87%E7%82%B9%E7%AC%A6%E5%8F%B7">标点符号_百度百科</a></li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>